# Тодорхой хугацааны дараа хуримтлалыг тооцох
# Банкны хадгаламжийн хүүг бодох функц бичнэ үү. Хэрэглэгч хадгаламжийн эхлэх дүн,
# жилийн хүүгийн хувь, хадгалах хугацааг оруулна. Тухайн хугацааны дараах хуримтлагдсан
# дүнг тооцоолно уу.
# ● Формула: A = P(1 + r/n)^(nt)
# ○ A = эцсийн дүн
# ○ P = эхлэх дүн
# ○ r = хүүгийн хувь (жилийн)
# ○ n = жилд хэдэн удаа хүү бодогдох (сараар бодох бол 12)
# ○ t = хадгалах хугацаа (жилээр)

# def calculate():
#     # Хэрэглэгчээс эхлэн дүн, жилийн хүүгийн хувь, хадгалах хугацаа, хүү тооцох давтасж
#     P = float(input("Эхлэх дүн"))
#     r = float(input("Хүүгийн хувь жишээ нь 5 хувь бол 0,05"))
#     t = float(input("Хадгалах хугацаа(Жилээр) "))
#     n = int(input("Жилд хэдэн удаа хүү бодогдох "))
#     A = P * (1 + r/n) ** (n*t)
#     print(f"Тухайн хугацааны дараах хуримтлагдсан : {A:.2f}")

# calculate() 

# Даалгавар 3: Өгүүлбэрт үгийн тоог тоолох
# Нэг өгүүлбэр доторх үгийн тоог тоолдог функц бичнэ үү. Хэрэглэгч өгүүлбэр оруулсны
# дараа нийт хэдэн үг байгааг тооцож харуулна.
# ● Жишээ:
# ○ Өгүүлбэр: "Сайн байна уу? Намайг Оюун гэдэг."
# ○ Үгийн тоо: 5

# def count_words():
#     #Хэрэглэгчээс өгүүлбэрийг олж авах хэсэг
#     sentence = input("Өгүүлбэрээ бичнэ үү?")
#     # Өгүүлбэрийг үг болгон хуваах
#     words = sentence.split()
#     # Үгийн тоог хэвлэх
#     print("Үгийн тоо " , len(words)) # len нь words оор салгаж авсан текстийн тоог хэвлэж байна

# count_words()

# Даалгавар 4: Палиндром үгийг шалгах
# Хэрэглэгчээс үг авдаг функц бичиж, уг үг нь палиндром эсэхийг шалгана уу. Палиндром үг
# гэдэг нь зүүнээс баруун, баруунаас зүүн тийш адилхан уншигддаг үг юм.
# ● Жишээ:
# ○ Үг: "radar" бол хариу True
# ○ Үг: "hello" бол хариу False

# def is_palindrom():
#     # Хэрэглэгчээс үг авах хэсэг
#     word = input("Үгээ оруулна : ")
#     # Палиндром хэсгийг шалгах хэсэг
#     if word == word[::-1]: # [::-1] Хойноос эхэлж уншихыг заах өгч байна
#         print("True")
#     else:
#         print("False")
# is_palindrom()

# Даалгавар 5: Гараас оруулсан бүх тооны нийлбэрийг олох
# Хэрэглэгчээс тоо оруулахыг хүсч, оруулсан бүх тоонуудыг нэмэх программ бичнэ үү.
# Хэрэглэгч done гэж бичих үед нэмэх үйлдлийг зогсооно

def numbers():
    # Нийт тоог нэмэх хэсэг
    total = 0
    while True:
        # Хэрэглэгчээс тоо авах
        user_input = input("Тоо оруулна уу Тоогоо оруулж дууссан бол (done гэж бичиж дуусгана уу): ")
        # Хэрэв хэрэглэгч 'done' гэж бичсэн бол давталтаас гарна
        if user_input.lower() == "done":
            break
        # Тоог нийт нийлбэрт нэмэх
        total += int(user_input)
    # Бүх тооны нийлбэрийг хэвлэх
    print("Бүх тооны нийлбэр:", total)

numbers()